# pandas

In [ ]:
# from __future__ import division
import os, sys

import numpy as np
import pandas as pd
from pandas import Series, DataFrame

# start draw
%matplotlib inline
import matplotlib.pyplot as plt

# globle config
np.random.seed(12345)
np.set_printoptions(precision=4)
plt.rc('figure', figsize=(10,6))

In [16]:
from __future__ import division
import os, sys

import numpy as np
import pandas as pd
from pandas import Series, DataFrame

%matplotlib inline
import matplotlib.pyplot as plt
from numpy import nan as NA
np.random.seed(12345)
np.set_printoptions(precision=4)
plt.rc('figure', figsize=(10, 6))

## pandas的数结构

In [17]:
a = [1, 3, 5]
print(a, type(a))

b = Series(a)
print(b, type(b))

[1, 3, 5] <class 'list'>
0    1
1    3
2    5
dtype: int64 <class 'pandas.core.series.Series'>

In [3]:
s = Series([2, 3, -4])
print(s)
print(s.index)
s = Series([2, 3, -4], index=['a', 'b', 'c'])
print(s)
print(s.index)

0    2
1    3
2   -4
dtype: int64
RangeIndex(start=0, stop=3, step=1)
a    2
b    3
c   -4
dtype: int64
Index(['a', 'b', 'c'], dtype='object')

In [4]:
a = [1, 3, 5]
b = Series(a, index=['a', 'b', 'c'])
b

a    1
b    3
c    5
dtype: int64

In [8]:
print(b['a'])
b['a'] = -1
b

1

a   -1
b    3
c    5
dtype: int64

In [12]:
# 类似map
s['a'] = 33
print(s['a'])
print(s)

33
a    33
b     3
c    -4
dtype: int64

In [15]:
# 切片
print(s[['a', 'b']])

a    33
b     3
dtype: int64

In [10]:
b[['a', 'b']]

a   -1
b    3
dtype: int64

In [19]:
# 过滤
s['d'] = -99
print(s)
s[s > 0]

a    33
b     3
c    -4
d   -99
dtype: int64

a    33
b     3
dtype: int64

In [11]:
b[b>0]

b    3
c    5
dtype: int64

In [20]:
s * 2

a     66
b      6
c     -8
d   -198
dtype: int64

In [15]:
b * 2

a    -2
b     6
c    10
dtype: int64

In [13]:
np.exp(b)

a      0.367879
b     20.085537
c    148.413159
dtype: float64

In [22]:
np.exp(s)

a    2.146436e+14
b    2.008554e+01
c    1.831564e-02
d    1.011221e-43
dtype: float64

In [33]:
print(s > 0)
np.sqrt(s[s > 0])

a     True
b     True
c    False
d    False
dtype: bool

a    5.744563
b    1.732051
dtype: float64

In [37]:
data = {'Ohio': 35000, 'Texas':71000, 'Oregon': 16000, 'Utah': 5000}
s3 = Series(data)
s3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [39]:
'Ohio' in s3

True

In [68]:
states = ['California', 'Ohio', 'Oregon']
s4 = Series(data, index=states)
s4

California        NaN
Ohio          35000.0
Oregon        16000.0
dtype: float64

In [43]:
# 检查缺省值
pd.isnull(s4)

California     True
Ohio          False
Oregon        False
dtype: bool

In [44]:
s4.notnull()

California    False
Ohio           True
Oregon         True
dtype: bool

In [47]:
print(s3)
print(s4)
s3 + s4

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64
California        NaN
Ohio          35000.0
Oregon        16000.0
dtype: float64

California        NaN
Ohio          70000.0
Oregon        32000.0
Texas             NaN
Utah              NaN
dtype: float64

In [69]:
s4.name = 'population'
s4.index.name = 'state'
s4.values[0] = 99
s4

state
California       99.0
Ohio          35000.0
Oregon        16000.0
Name: population, dtype: float64

In [71]:
print(s4.index)
s4.index = ['1', '2', '3']
s4

Index(['California', 'Ohio', 'Oregon'], dtype='object', name='state')

1       99.0
2    35000.0
3    16000.0
Name: population, dtype: float64

## DataFrame

In [83]:
# data是一个字典
data = {
    'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
    'year':  [2000, 2001, 2002, 2001, 2002],
    'pop': [1.5, 1.7, 3.6, 2.4, 2.9],
}
frame = DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [87]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'])
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN

In [90]:
print(frame2['pop'], type(frame2['pop']))

0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
Name: pop, dtype: float64 <class 'pandas.core.series.Series'>

In [91]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
Name: year, dtype: int64

In [95]:
# 返回特定行
frame2.loc[0]

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: 0, dtype: object

In [105]:
# 给列赋值
frame2['debt'] = [16.5, 1,1,16.5,16.5]
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   1.0
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5

In [110]:
nn = np.arange(5) * 2
print(nn)
frame2['debt'] = nn
frame2

[0 2 4 6 8]

   year   state  pop  debt
0  2000    Ohio  1.5     0
1  2001    Ohio  1.7     2
2  2002    Ohio  3.6     4
3  2001  Nevada  2.4     6
4  2002  Nevada  2.9     8

In [124]:
# 使用Series
print(np.arange(5))
val = Series([-1.2, -1.5, -1.7], index=np.arange(3))
print(val)
frame2['debt'] = val
frame2

[0 1 2 3 4]
0   -1.2
1   -1.5
2   -1.7
dtype: float64

   year   state  pop  debt
0  2000    Ohio  1.5  -1.2
1  2001    Ohio  1.7  -1.5
2  2002    Ohio  3.6  -1.7
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN

In [131]:
# 索引
print(frame2.loc[1]['year'])
print(frame2['year'][1])

2001
2001

In [142]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5  -1.2     True
1  2001    Ohio  1.7  -1.5     True
2  2002    Ohio  3.6  -1.7     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9   NaN    False

In [143]:
# 删除列
del frame2['eastern']
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  -1.2
1  2001    Ohio  1.7  -1.5
2  2002    Ohio  3.6  -1.7
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN

In [170]:
# 嵌套字典
pop = {
    'Nevada': {
        2000: 2.9,
        2001: 2.4,
        2002: 2.9
    },
    'Ohio': {
        2000: 1.5,
        2001: 1.7,
        2002: 3.6
    }
}
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     2.9   1.5
2001     2.4   1.7
2002     2.9   3.6

In [172]:
frame3.T

        2000  2001  2002
Nevada   2.9   2.4   2.9
Ohio     1.5   1.7   3.6

In [176]:
print(frame3)
print('\n')
print(frame3['Ohio'][:-1])

      Nevada  Ohio
2000     2.9   1.5
2001     2.4   1.7
2002     2.9   3.6


2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [179]:
# 设置属性
frame3.index.name = '年'
frame3.columns.name = '州'

frame3

州     Nevada  Ohio
年
2000     2.9   1.5
2001     2.4   1.7
2002     2.9   3.6

In [180]:
# 数据
frame3.values

array([[2.9, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [181]:
frame2.values

array([[2000, 'Ohio', 1.5, -1.2],
       [2001, 'Ohio', 1.7, -1.5],
       [2002, 'Ohio', 3.6, -1.7],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, nan]], dtype=object)

## 索引对象

In [187]:
obj = Series(list(range(3)), index=['a', 'b', 'c'])
print(obj)
index = obj.index
index

a    0
b    1
c    2
dtype: int64

Index(['a', 'b', 'c'], dtype='object')

In [188]:
index[1:]

Index(['b', 'c'], dtype='object')

In [191]:
# index不能修该，从而保证共享安全
# index[1] = 'f'

In [198]:
index = pd.Index(np.arange(3))
print(index, type(index))
s2 = Series([1.5, -2.5, 0], index=index)
print(s2.index, type(s2.index))
s2.index is index

Int64Index([0, 1, 2], dtype='int64') <class 'pandas.core.indexes.numeric.Int64Index'>
Int64Index([0, 1, 2], dtype='int64') <class 'pandas.core.indexes.numeric.Int64Index'>

True

In [224]:
# 值传播
s3 = Series(['b', 'p', 'y'], index=[0, 3, 6])
print(s3.reindex(list(range(9)), method='ffill'))
print(s3.reindex(list(range(9)), method='bfill'))
print(s3.reindex(list(range(9)), method='nearest'))

0    b
1    b
2    b
3    p
4    p
5    p
6    y
7    y
8    y
dtype: object
0      b
1      p
2      p
3      p
4      y
5      y
6      y
7    NaN
8    NaN
dtype: object
0    b
1    b
2    p
3    p
4    p
5    y
6    y
7    y
8    y
dtype: object

In [229]:
# 删除列轴 Series记录 DataFrame表
f = DataFrame(np.arange(16).reshape(4,4), index=np.arange(4), columns=np.arange(4))
f

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [230]:
s = f.loc[0]
s

0    0
1    1
2    2
3    3
Name: 0, dtype: int64

In [240]:
# Series不能删除列，因为本身就是一维，删除列意味删除整个数据
s.drop(2)
# s.drop(2, axis=1)

0    0
1    1
3    3
Name: 0, dtype: int64

In [235]:
f.drop(2)

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
3  12  13  14  15

In [241]:
# FrameData则可以 ，因为是多维，且必须指定列轴axis=1
f.drop([2, 3], axis=1)

    0   1
0   0   1
1   4   5
2   8   9
3  12  13

In [243]:
s

0    0
1    1
2    2
3    3
Name: 0, dtype: int64

In [253]:
# 索引
s[1:3]

1    1
2    2
Name: 0, dtype: int64

In [257]:
s[[1,2]]

1    1
2    2
Name: 0, dtype: int64

In [270]:
s[s>0][s<4]

False

1    1
2    2
3    3
Name: 0, dtype: int64

In [271]:
# 应用lambda
f

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [272]:
# 求极差 默认轴0
l = lambda x: x.max() - x.min()
f.apply(l)

0    12
1    12
2    12
3    12
dtype: int64

In [273]:
f.apply(l, axis=1)

0    3
1    3
2    3
3    3
dtype: int64

In [277]:
f

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [279]:
# 传进来的是列维
def fuc(x):
    return Series([x.min(), x.max()], index=['min', 'max'])
f.apply(fuc)

      0   1   2   3
min   0   1   2   3
max  12  13  14  15

In [285]:
# 元素级map
format = lambda x: x-1
f.applymap(format)

    0   1   2   3
0  -1   0   1   2
1   3   4   5   6
2   7   8   9  10
3  11  12  13  14

## 排序

In [287]:
f

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [292]:
f.sort_index(ascending=False).sort_index(axis=1, ascending=False)

    3   2   1   0
3  15  14  13  12
2  11  10   9   8
1   7   6   5   4
0   3   2   1   0

In [296]:
f

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [305]:
f.sort_values(by=[1], ascending=False).sort_values(by=[2], ascending=True)

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

## 排名

In [306]:
s

0    0
1    1
2    2
3    3
Name: 0, dtype: int64

In [310]:
s[2] = 1
s

0    0
1    1
2    1
3    3
Name: 0, dtype: int64

In [312]:
s.rank(method='first')

0    1.0
1    2.0
2    3.0
3    4.0
Name: 0, dtype: float64

In [313]:
s.rank(method='max')

0    1.0
1    3.0
2    3.0
3    4.0
Name: 0, dtype: float64

In [319]:
s[2] = 2
f

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [316]:
# 按列排名
f.rank()

     0    1    2    3
0  1.0  1.0  1.0  1.0
1  2.0  2.0  2.0  2.0
2  3.0  3.0  3.0  3.0
3  4.0  4.0  4.0  4.0

In [320]:
f.rank(axis=1)

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  1.0  2.0  3.0  4.0
2  1.0  2.0  3.0  4.0
3  1.0  2.0  3.0  4.0

## 数据汇总和描述统计

In [322]:
f

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [321]:
# 默认按列
f.sum()

0    24
1    28
2    32
3    36
dtype: int64

In [323]:
f.sum(axis=1)

0     6
1    22
2    38
3    54
dtype: int64

In [324]:
f.idxmax()

0    3
1    3
2    3
3    3
dtype: int64

In [325]:
f.cumsum()

    0   1   2   3
0   0   1   2   3
1   4   6   8  10
2  12  15  18  21
3  24  28  32  36

In [326]:
## 5数概括
f.describe()

               0          1          2          3
count   4.000000   4.000000   4.000000   4.000000
mean    6.000000   7.000000   8.000000   9.000000
std     5.163978   5.163978   5.163978   5.163978
min     0.000000   1.000000   2.000000   3.000000
25%     3.000000   4.000000   5.000000   6.000000
50%     6.000000   7.000000   8.000000   9.000000
75%     9.000000  10.000000  11.000000  12.000000
max    12.000000  13.000000  14.000000  15.000000

In [329]:
f

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [330]:
f.diff(axis=1)

    0    1    2    3
0 NaN  1.0  1.0  1.0
1 NaN  1.0  1.0  1.0
2 NaN  1.0  1.0  1.0
3 NaN  1.0  1.0  1.0

In [331]:
f.cumprod()

   0    1     2     3
0  0    1     2     3
1  0    5    12    21
2  0   45   120   231
3  0  585  1680  3465

In [334]:
f.pct_change()

     0         1         2         3
0  NaN       NaN       NaN       NaN
1  inf  4.000000  2.000000  1.333333
2  1.0  0.800000  0.666667  0.571429
3  0.5  0.444444  0.400000  0.363636

## 相关系数与协方差

In [11]:
#%conda install pandas-datareader
%conda list pandas-datareader

WARNING: The conda.compat module is deprecated and will be removed in a future release.
# packages in environment at /root/anaconda3/envs/DataMining:
#
# Name                    Version                   Build  Channel
pandas-datareader         0.8.1                      py_0

Note: you may need to restart the kernel to use updated packages.

In [120]:
import pandas_datareader as pdr
from pandas_datareader import data, wb

In [146]:
all_stock = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_stock[ticker] = data.get_data_yahoo(ticker, start='12/1/2018')

In [147]:
all_stock.items()

dict_items([('AAPL',                   High         Low  ...      Volume   Adj Close
Date                                ...
2018-11-30  180.330002  177.029999  ...  39531500.0  175.936554
2018-12-03  184.940002  181.210007  ...  40802500.0  182.084183
2018-12-04  182.389999  176.270004  ...  41344300.0  174.074539
2018-12-06  174.779999  170.419998  ...  43098400.0  172.133682
2018-12-07  174.490005  168.300003  ...  42281600.0  165.995926
...                ...         ...  ...         ...         ...
2020-01-06  299.959991  292.750000  ...  29596800.0  299.799988
2020-01-07  300.899994  297.480011  ...  27218000.0  298.390015
2020-01-08  304.440002  297.160004  ...  33019800.0  303.190002
2020-01-09  310.429993  306.200012  ...  42527100.0  309.630005
2020-01-10  312.670013  308.250000  ...  35217272.0  310.329987

[279 rows x 6 columns]), ('IBM',                   High         Low  ...     Volume   Adj Close
Date                                ...
2018-11-30  124.690002  121.480003  ...  7251600.0  118.582451
2018-12-03  126.589996  124.360001  ...  5846400.0  119.574867
2018-12-04  124.919998  121.330002  ...  6000700.0  116.034653
2018-12-06  123.910004  119.300003  ...  6938000.0  118.238937
2018-12-07  124.050003  118.870003  ...  7019600.0  113.878090
...                ...         ...  ...        ...         ...
2020-01-06  134.240005  133.199997  ...  2425500.0  134.100006
2020-01-07  134.960007  133.399994  ...  3090800.0  134.190002
2020-01-08  135.860001  133.919998  ...  4346000.0  135.309998
2020-01-09  136.789993  135.309998  ...  3730600.0  136.740005
2020-01-10  137.869995  136.309998  ...  3181726.0  136.690002

[279 rows x 6 columns]), ('MSFT',                   High         Low  ...      Volume   Adj Close
Date                                ...
2018-11-30  110.970001  109.360001  ...  33665600.0  109.274261
2018-12-03  113.419998  110.730003  ...  34732800.0  110.456779
2018-12-04  112.639999  108.209999  ...  45197000.0  106.938789
2018-12-06  109.239998  105.000000  ...  49107400.0  107.599037
2018-12-07  109.449997  104.300003  ...  45044900.0  103.292702
...                ...         ...  ...         ...         ...
2020-01-06  159.100006  156.509995  ...  20813700.0  159.029999
2020-01-07  159.669998  157.320007  ...  21634100.0  157.580002
2020-01-08  160.800003  157.949997  ...  27746500.0  160.089996
2020-01-09  162.220001  161.029999  ...  21385000.0  162.089996
2020-01-10  163.220001  161.179993  ...  16885562.0  161.339996

[279 rows x 6 columns]), ('GOOG',                    High          Low  ...   Volume    Adj Close
Date                                  ...
2018-11-30  1095.569946  1077.880005  ...  2580200  1094.430054
2018-12-03  1124.650024  1103.665039  ...  1991200  1106.430054
2018-12-04  1104.420044  1049.979980  ...  2345200  1050.819946
2018-12-06  1071.199951  1030.770020  ...  2769200  1068.729980
2018-12-07  1075.260010  1028.500000  ...  2101200  1036.579956
...                 ...          ...  ...      ...          ...
2020-01-06  1396.500000  1350.000000  ...  1732300  1394.209961
2020-01-07  1402.989990  1390.380005  ...  1502700  1393.339966
2020-01-08  1411.579956  1390.839966  ...  1528000  1404.319946
2020-01-09  1427.329956  1410.270020  ...  1500900  1419.829956
2020-01-10  1434.929199  1418.895020  ...  1821566  1429.729980

[279 rows x 6 columns])])

In [148]:
all_stock['GOOG']

                   High          Low  ...   Volume    Adj Close
Date                                  ...
2018-11-30  1095.569946  1077.880005  ...  2580200  1094.430054
2018-12-03  1124.650024  1103.665039  ...  1991200  1106.430054
2018-12-04  1104.420044  1049.979980  ...  2345200  1050.819946
2018-12-06  1071.199951  1030.770020  ...  2769200  1068.729980
2018-12-07  1075.260010  1028.500000  ...  2101200  1036.579956
...                 ...          ...  ...      ...          ...
2020-01-06  1396.500000  1350.000000  ...  1732300  1394.209961
2020-01-07  1402.989990  1390.380005  ...  1502700  1393.339966
2020-01-08  1411.579956  1390.839966  ...  1528000  1404.319946
2020-01-09  1427.329956  1410.270020  ...  1500900  1419.829956
2020-01-10  1434.929199  1418.895020  ...  1821566  1429.729980

[279 rows x 6 columns]

In [149]:
price = DataFrame({
    tic: data['Close'] for tic, data in all_stock.items()
})
price

                  AAPL         IBM        MSFT         GOOG
Date
2018-11-30  178.580002  124.269997  110.889999  1094.430054
2018-12-03  184.820007  125.309998  112.089996  1106.430054
2018-12-04  176.690002  121.599998  108.519997  1050.819946
2018-12-06  174.720001  123.910004  109.190002  1068.729980
2018-12-07  168.490005  119.339996  104.820000  1036.579956
...                ...         ...         ...          ...
2020-01-06  299.799988  134.100006  159.029999  1394.209961
2020-01-07  298.390015  134.190002  157.580002  1393.339966
2020-01-08  303.190002  135.309998  160.089996  1404.319946
2020-01-09  309.630005  136.740005  162.089996  1419.829956
2020-01-10  310.329987  136.690002  161.339996  1429.729980

[279 rows x 4 columns]

In [150]:
volume = DataFrame({
    tic: data['Volume'] for tic, data in all_stock.items()
})
open = DataFrame({
    tic: data['Open'] for tic, data in all_stock.items()
})
high = DataFrame({
    tic: data['High'] for tic, data in all_stock.items()
})
low = DataFrame({
    tic: data['Low'] for tic, data in all_stock.items()
})

In [151]:
returns = price.pct_change()
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2020-01-06  0.007968 -0.001786  0.002585  0.024657
2020-01-07 -0.004703  0.000671 -0.009118 -0.000624
2020-01-08  0.016086  0.008346  0.015928  0.007880
2020-01-09  0.021241  0.010568  0.012493  0.011044
2020-01-10  0.002261 -0.000366 -0.004627  0.006973

In [152]:
returns.MSFT.tail()

Date
2020-01-06    0.002585
2020-01-07   -0.009118
2020-01-08    0.015928
2020-01-09    0.012493
2020-01-10   -0.004627
Name: MSFT, dtype: float64

**回顾**

方差(variance)

$$\sigma^2 = \frac{1}{N} \sum\limits_{i=1}^{N} (x_i - \overline{x})$$

标准差(standard deviation)

$$\sigma = \sqrt{\sigma^2}$$

协方差(推导看书64)(covariance)

$$Cov(A,B) = E(A \cdot B) - \overline{A} \overline{B}$$

相关系数(p63)
$$r_{a,b}=\frac{Cov(A,B)}{\sigma_A\sigma_B}$$

In [153]:
sigma_A = returns.MSFT.std()
sigma_B = returns.AAPL.std()

In [154]:
returns.MSFT.std()

0.01401128727997197

In [155]:
cov_A_B = returns.MSFT.cov(returns.AAPL)
cov_A_B

0.0001667652326156241

In [156]:
r_A_B = cov_A_B / (sigma_A * sigma_B)
r_A_B

0.6792830912879642

In [157]:
returns.MSFT.corr(returns.AAPL)

0.6792830912879643

In [158]:
returns.MSFT.corr(returns.IBM)

0.5978217518942291

In [159]:
returns.AAPL.corr(returns.MSFT)

0.6792830912879643

### 对整个数据

In [160]:
price.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.325166  0.924901  0.918754
IBM   0.325166  1.000000  0.453675  0.419305
MSFT  0.924901  0.453675  1.000000  0.811203
GOOG  0.918754  0.419305  0.811203  1.000000

In [161]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.506485  0.679283  0.609399
IBM   0.506485  1.000000  0.597822  0.458513
MSFT  0.679283  0.597822  1.000000  0.670301
GOOG  0.609399  0.458513  0.670301  1.000000

In [162]:
price.cov()

             AAPL         IBM         MSFT         GOOG
AAPL  1443.071408   96.711457   577.492675  3264.647431
IBM     96.711457   61.299542    58.382270   307.079732
MSFT   577.492675   58.382270   270.156229  1247.182626
GOOG  3264.647431  307.079732  1247.182626  8749.552936

In [163]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000307  0.000120  0.000167  0.000170
IBM   0.000120  0.000183  0.000113  0.000099
MSFT  0.000167  0.000113  0.000196  0.000149
GOOG  0.000170  0.000099  0.000149  0.000253

In [164]:
returns.corrwith(returns.IBM)

AAPL    0.506485
IBM     1.000000
MSFT    0.597822
GOOG    0.458513
dtype: float64

In [166]:
returns.corrwith(volume)

AAPL   -0.179810
IBM     0.011694
MSFT   -0.140325
GOOG   -0.125945
dtype: float64

In [168]:
returns.corrwith(volume, axis=1).tail()

Date
2020-01-06   -0.266437
2020-01-07   -0.812659
2020-01-08    0.992274
2020-01-09    0.944191
2020-01-10   -0.209985
dtype: float64

### 唯一值、值计数

In [171]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [172]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [174]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [176]:
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [180]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [182]:
data = DataFrame({
    'Qu1': [1, 3, 4, 3, 4],
    'Qu2': [2, 3, 1, 2, 3],
    'Qu3': [1, 5, 2, 4, 4],
})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [183]:
data.Qu1.value_counts()

4    2
3    2
1    1
Name: Qu1, dtype: int64

In [185]:
data.apply(pd.value_counts).fillna(0)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

### 缺省值

In [208]:
data['Qu1'] = np.nan

In [213]:
data.dropna(how='all')

   Qu1  Qu2  Qu3
0  NaN  2.0  1.0
1  NaN  3.0  5.0
2  NaN  1.0  2.0
3  NaN  2.0  4.0
4  NaN  3.0  4.0

In [3]:
df = DataFrame(np.random.randn(6, 3))
df

          0         1         2
0 -0.204708  0.478943 -0.519439
1 -0.555730  1.965781  1.393406
2  0.092908  0.281746  0.769023
3  1.246435  1.007189 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843

简单的说：
iloc，即index locate 用index索引进行定位，所以参数是整型，如：df.iloc[10:20, 3:5]
loc，则可以使用column名和index名进行定位，如：
df.loc[‘image1’:‘image10’, ‘age’:‘score’]

In [26]:
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.204708       NaN       NaN
1 -0.555730       NaN       NaN
2  0.092908       NaN  0.769023
3  1.246435       NaN -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843

In [14]:
df.dropna(thresh=2)

          0         1         2
2  0.092908       NaN  0.769023
3  1.246435       NaN -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843

In [16]:
df.fillna(0)

          0         1         2
0 -0.204708  0.000000  0.000000
1 -0.555730  0.000000  0.000000
2  0.092908  0.000000  0.769023
3  1.246435  0.000000 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843

In [25]:
# 修改
df.fillna({1: 0.5, 2: -1}, inplace=True)
df

          0         1         2
0 -0.204708  0.500000 -1.000000
1 -0.555730  0.500000 -1.000000
2  0.092908  0.500000  0.769023
3  1.246435  0.500000 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843

In [27]:
df

          0         1         2
0 -0.204708       NaN       NaN
1 -0.555730       NaN       NaN
2  0.092908       NaN  0.769023
3  1.246435       NaN -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843

In [30]:
# ffill取前值
df.fillna(method='ffill', axis=1)

          0         1         2
0 -0.204708 -0.204708 -0.204708
1 -0.555730 -0.555730 -0.555730
2  0.092908  0.092908  0.769023
3  1.246435  1.246435 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843

In [35]:
# bfill取后值
df.fillna(method='bfill', axis=1)

          0         1         2
0 -0.204708       NaN       NaN
1 -0.555730       NaN       NaN
2  0.092908  0.769023  0.769023
3  1.246435 -1.296221 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843

In [33]:
df.fillna(method='bfill', limit=2)

          0         1         2
0 -0.204708       NaN  0.769023
1 -0.555730       NaN  0.769023
2  0.092908  0.228913  0.769023
3  1.246435  0.228913 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843

In [38]:
df

          0         1         2
0 -0.204708       NaN       NaN
1 -0.555730       NaN       NaN
2  0.092908       NaN  0.769023
3  1.246435       NaN -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843

In [40]:
df.mean()

0    0.290054
1   -0.886362
2    0.113469
dtype: float64

In [39]:
df.median()

0    0.183950
1   -0.886362
2    0.198590
dtype: float64

In [48]:
print(type(df.median()))

<class 'pandas.core.series.Series'>

In [60]:
a = df.median()
print(a)
a[2] = 2
df.fillna(a, inplace=True)

0    0.183950
1   -0.886362
2    0.198590
dtype: float64

In [61]:
df

          0         1         2
0 -0.204708 -0.886362  2.000000
1 -0.555730 -0.886362  2.000000
2  0.092908 -0.886362  0.769023
3  1.246435 -0.886362 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843

In [63]:
df.mode()

          0         1    2
0 -0.555730 -0.886362  2.0
1 -0.204708       NaN  NaN
2  0.092908       NaN  NaN
3  0.274992       NaN  NaN
4  0.886429       NaN  NaN
5  1.246435       NaN  NaN

### 层次化索引

In [74]:
np.random.randn(3)

array([-0.914 ,  0.9193,  0.3772])

In [76]:
data = Series(np.random.randn(10),
             index=[
                 ['a','a','a','b','b','b','c','c','d','d'],
                 [1,2,3,1,2,3,1,2,2,3]
             ])
data

a  1   -0.156025
   2    1.762533
   3   -1.021051
b  1    0.702962
   2   -2.020859
   3   -0.773160
c  1    0.110306
   2   -0.754475
d  2    0.357077
   3    0.295236
dtype: float64

In [77]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 2),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [78]:
data['a']

1   -0.156025
2    1.762533
3   -1.021051
dtype: float64

In [82]:
data[['a', 'c']]

a  1   -0.156025
   2    1.762533
   3   -1.021051
c  1    0.110306
   2   -0.754475
dtype: float64

In [84]:
data['a': 'c']

a  1   -0.156025
   2    1.762533
   3   -1.021051
b  1    0.702962
   2   -2.020859
   3   -0.773160
c  1    0.110306
   2   -0.754475
dtype: float64

In [86]:
data[:,1]

a   -0.156025
b    0.702962
c    0.110306
dtype: float64

In [96]:
data[:,2]

a    1.762533
b   -2.020859
c   -0.754475
d    0.357077
dtype: float64

In [98]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 2),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [100]:
data

a  1   -0.156025
   2    1.762533
   3   -1.021051
b  1    0.702962
   2   -2.020859
   3   -0.773160
c  1    0.110306
   2   -0.754475
d  2    0.357077
   3    0.295236
dtype: float64

转DataFrame

In [101]:
data.unstack()

          1         2         3
a -0.156025  1.762533 -1.021051
b  0.702962 -2.020859 -0.773160
c  0.110306 -0.754475       NaN
d       NaN  0.357077  0.295236

In [102]:
data.unstack().stack()

a  1   -0.156025
   2    1.762533
   3   -1.021051
b  1    0.702962
   2   -2.020859
   3   -0.773160
c  1    0.110306
   2   -0.754475
d  2    0.357077
   3    0.295236
dtype: float64

DataFrame的分层索引

In [104]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
                  index=[['a', 'a', 'b', 'b'],[1, 2, 1, 2]],
                 columns=[['Ohio', 'Ohio', 'Colorado'],['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [105]:
frame.index

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [107]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [108]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [116]:
print(frame)
print(frame.swaplevel('key1', 'key2'))
print(frame.sort_index(level=1))
print(frame.swaplevel('key1', 'key2').sort_index(level=0))
print(frame.swaplevel(0, 1, axis=1).sort_index(level=0, axis=1))

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11
state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11
state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11
state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11
color        Green       Red
state     Colorado Ohio Ohio
key1 key2
a    1           2    0    1
     2           5    3    4
b    1           8    6    7
     2          11    9   10

In [118]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [121]:
frame.sum(level='color', axis=1).sum(level='key2')

color  Green  Red
key2
1         16    8
2         28   14

In [123]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [127]:
frame = DataFrame({
    'a' : list(range(7)),
    'b' : list(range(7, 0, -1)),
    'c' : ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
    'd' : [0, 1, 2, 0, 1, 2, 3]
})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [128]:
frame.set_index(['c', 'd'])

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [129]:
frame.set_index(['a', 'b'])

       c  d
a b
0 7  one  0
1 6  one  1
2 5  one  2
3 4  two  0
4 3  two  1
5 2  two  2
6 1  two  3

In [131]:
frame.set_index(['c']).reset_index()

     c  a  b  d
0  one  0  7  0
1  one  1  6  1
2  one  2  5  2
3  two  3  4  0
4  two  4  3  1
5  two  5  2  2
6  two  6  1  3

In [140]:
ser = Series(np.arange(3)+1, index=[1, 2, 3])
ser

1    1
2    2
3    3
dtype: int64

In [142]:
ser.iloc[0]

1